Revit 2027 API
ParameterTypeId.StructuralAttachmentEndRefelementEnd Property
 "End of Attachment to Reference Element"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAttachmentEndRefelementEnd { get; }
Public Shared ReadOnly Property StructuralAttachmentEndRefelementEnd As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAttachmentEndRefelementEnd {
	ForgeTypeId^ get ();
}
static member StructuralAttachmentEndRefelementEnd : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace